package main

/*
Есть матрица NxN, состоящая из 0 и 1, и отражающая расположения кораблей на поле для морского боя. - Кораблей может быть любое количество.
Размер кораблей - от 1х1 до 1хN.
Корабли никак не соприкасаются друг с другом.
Корабли располагаются горизонтально и вертикально.
Необходимо подсчитать количество кораблей.
Пример: [1, 1, 0, 0, 1, 0], [0, 0, 0, 0, 1, 0], [1, 0, 1, 0, 1, 0], [0, 0, 0, 0, 0, 0], [1, 0, 1, 1, 1, 1], [0, 0, 0, 0, 0, 0],
package main

import "fmt"

func solve(field [][]int) int {
  return 0
}

func main() {
  var field = [][]int{
    {1, 1, 0, 0, 1, 0},
    {1, 0, 0, 0, 1, 0},
    {1, 0, 1, 0, 1, 0},
    {0, 0, 0, 0, 0, 0},
    {1, 0, 1, 1, 1, 1},
    {0, 0, 0, 0, 0, 0},
  }

  fmt.Println(solve(field))
}
*/
