package main

/*
// Продавцы в X участвовали во в‍‍‍⁠‍⁠‍⁠⁠‍⁠‍‍⁠⁠‍‍⁠⁠⁠⁠‍⁠⁠‍‍⁠‍⁠‍⁠‍⁠‍⁠‍‍‍‍⁠нутреннем конкурсе по распродажам.
// Победителями стали те, кто продал больше всех
// Результаты п‍‍‍⁠‍⁠‍⁠⁠‍⁠‍‍⁠⁠‍‍⁠⁠⁠⁠‍⁠⁠‍‍⁠‍⁠‍⁠‍⁠‍⁠‍‍‍‍⁠ока не оглашены, но продавцы требуют хоть что-то.
// Принято решение в предварительной форме вернуть информацию, сколько других участников удалось опередить.
// Считаем, что общее количество участников П‍‍‍⁠‍⁠‍⁠⁠‍⁠‍‍⁠⁠‍‍⁠⁠⁠⁠‍⁠⁠‍‍⁠‍⁠‍⁠‍⁠‍⁠‍‍‍‍⁠РОДАВЦУ НЕизвестно, чтобы по возвращенной информации он не мог понять, какое место занял

// На основе имеющейся информации о продажах надо вернуть количество продавцов, которые остались позади

// Пример 1
// in
sales = [8,1,2,2,3]
// out
sellers = [4,0,1,1,3]

// Пример 2
// in
sales = [5,5,5,5]
// out
sellers = [0,0,0,0]
*/
